In [2]:
import pandas as pd
import numpy as np

#creating data
stuff = {
    'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary': [200, 220, 190, 130, 120, 150]
}

my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [6]:
#Creating Function
def times1000(x):
    return format (x*1000, ",d")

In [7]:
my_df["Salary"].apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

In [8]:
#making it into a dataframe
pd.DataFrame(my_df["Salary"].apply(times1000))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000

In [9]:
#Add a last name
def namer(x):
    if x =='John':
        return "John Elder"
    else:
        return x

In [11]:
my_df["Employees"].apply(namer)

0    John Elder
1         April
2           Wes
3          Beth
4        Justin
5         Steph
Name: Employees, dtype: object

In [14]:
#using lambda, writing functions in one line
pd.DataFrame(my_df["Salary"].apply(lambda x: format(x * 100, ",d")))

   Salary
0  20,000
1  22,000
2  19,000
3  13,000
4  12,000
5  15,000